<h2>Knopflerfish&#12288;&#12458;&#12540;&#12503;&#12531;&#12539;&#12477;&#12540;&#12473;&#12288;OSGi&#12288;&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12408;&#12424;&#12358;&#12371;&#12381;&#12290;&#12288;</h2>
<a name="about_knopflerfish"></a>
<table cellspacing="8">
<tbody><tr>
<td class="cellwide" rowspan="2">
<p>
Knopflerfish&#12507;&#12540;&#12512;&#12506;&#12540;&#12472;&#12408;&#12450;&#12463;&#12475;&#12473;&#12354;&#12426;&#12364;&#12392;&#12358;&#12372;&#12374;&#12356;&#12414;&#12377;&#12290;Knopflerfish&#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12399;&#12289;&#12458;&#12540;&#12503;&#12531;&#12539;&#12477;&#12540;&#12473;&#12539;&#12467;&#12540;&#12489;&#12434;&#29992;&#24847;&#12395;&#38283;&#30330;&#12289;&#20998;&#37197;&#12375;&#12289;OSGi&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#12395;&#38306;&#36899;&#12375;&#12383;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12420;&#12484;&#12540;&#12523;&#12434;&#27083;&#31689;&#12375;&#12390;&#12356;&#12367;&#12371;&#12392;&#30446;&#30340;&#12395;&#30330;&#36275;&#12356;&#12383;&#12375;&#12414;&#12375;&#12383;&#12290;&#12288;
&#12371;&#12385;&#12425;&#12434;&#12372;&#21442;&#32771;&#12367;&#12384;&#12373;&#12356;&#12290;
</p>
<p>
&#12466;&#12540;&#12488;&#12473;&#12506;&#12540;&#12473;&#12539;&#12486;&#12524;&#12510;&#12486;&#12451;&#12483;&#12463;&#12473;&#31038;&#12399;&#12289;Knopflerfish &#12503;&#12525;&#12472;&#12455;&#12463;&#12488;&#12398;&#12513;&#12452;&#12531;&#12486;&#12452;&#12490;&#12540;&#21450;&#12403;&#12473;&#12509;&#12531;&#12469;&#12540;&#12391;&#12354;&#12426;&#12289;Knopflerfish&#12398;OSGi&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;&#20998;&#37197;&#12434;&#38283;&#30330;&#12289;&#21450;&#12403;&#32173;&#25345;&#12375;&#12390;&#12356;&#12367;&#12383;&#12417;&#12398;&#23554;&#38272;&#12398;&#25216;&#34899;&#32773;&#12434;&#25968;&#21517;&#20445;&#26377;&#12375;&#12390;&#12362;&#12426;&#12414;&#12377;&#12290;
</p>
<p>
OSGi&#65288;&#12458;&#12540;&#12503;&#12531;&#12539;&#12477;&#12540;&#12473;&#12539;&#12466;&#12540;&#12488;&#12454;&#12455;&#12452;&#12539;&#12452;&#12491;&#12486;&#12451;&#12450;&#12486;&#12451;&#12502;&#65289;&#12399;&#12289;&#35079;&#25968;&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12434;&#35377;&#23481;&#12375;&#12394;&#12364;&#12425;&#12289;&#21807;&#19968;&#12398;JAVA&#20206;&#24819;&#12510;&#12471;&#12531;&#19978;&#12391;&#31292;&#21205;&#12391;&#12365;&#12427;&#12424;&#12358;
&#12394;&#26989;&#30028;&#27161;&#28310;&#12395;&#22522;&#12389;&#12356;&#12383;JAVA&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#12539;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12398;&#20181;&#27096;&#12434;&#25351;&#23450;&#12375;&#12414;&#12377;&#12290;&#12371;&#12428;&#12425;&#12398;&#12503;&#12525;&#12464;&#12521;&#12512;&#12399;&#12289;&#12487;&#12540;&#12479;&#12289;&#27231;&#33021;&#24615;&#12289;&#12473;&#12524;&#12483;&#12489;&#12392;&#12375;&#12390;&#12522;&#12477;&#12540;&#12473;
&#12434;&#20849;&#26377;&#12377;&#12427;&#12371;&#12392;&#12364;&#21487;&#33021;&#12391;&#12377;&#12290;
</p>
<p>OSGi&#12398;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#37096;&#20998;&#12399;&#12289;&#32068;&#12415;&#36796;&#12415;&#27231;&#22120;&#19978;&#12398;&#12469;&#12540;&#12499;&#12473;&#12539;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#12392;&#12375;&#12390;&#12450;&#12503;&#12522;&#12465;&#12540;&#12471;&#12519;&#12531;&#21033;&#29992;&#12363;&#12425;&#12289;&#26356;&#12395;&#35215;&#27169;&#12398;&#22823;&#12365;&#12356;&#12503;&#12525;&#12464;&#12521;&#12512;&#12408;&#12398;
&#12503;&#12521;&#12464;&#12452;&#12531;&#12539;&#12513;&#12459;&#12491;&#12474;&#12512;&#12414;&#12391;&#24133;&#24195;&#12356;&#12524;&#12531;&#12472;&#12391;&#27083;&#31689;&#12364;&#21487;&#33021;&#12392;&#12394;&#12426;&#12414;&#12377;&#12290;&#12288;OSGi&#12398;&#21021;&#26399;&#12398;&#30446;&#27161;&#12399;&#12289;&#32068;&#12415;&#36796;&#12415;&#24066;&#22580;&#12391;&#12354;&#12426;&#12414;&#12375;&#12383;&#12364;&#12289;&#20182;&#26989;&#30028;&#12391;&#12398;&#21029;&#12394;&#29992;&#36884;&#12418;&#32771;&#24942;&#12373;&#12428;
&#12390;&#12365;&#12390;&#12362;&#12426;&#12414;&#12377;&#12290;
</p>
<p>
OSGi&#12288;&#12450;&#12521;&#12452;&#12450;&#12531;&#12473;&#12395;&#38306;&#12377;&#12427;&#26356;&#12394;&#12427;&#24773;&#22577;&#12399;&#12289;&#19979;&#35352;&#12434;&#12372;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;&#12288;
http://www.ogsi.org
&#12494;&#12502;&#12373;&#12435;&#12290;&#19978;&#35352;&#12399;&#12289;&#19979;&#35352;&#12398;&#26528;&#20869;&#12398;&#37096;&#20998;&#12391;&#12377;&#12290;&#12288;
</p>
</td>
<!----- LATEST NEWS ----->
<td class="cellnarrow">
<h3 class="h3news">Latest News</h3>
<table class="newstable">
<tbody><tr>
<td class="newsdate">25 Sep 2006</td>
<td class="newstext">
<a href="news.html">
Knopflerfish Bundle Repository updated</a><br>
</td>
</tr>
</tbody></table>
</td>
</tr>
<tr>
<td class="cellblock" colspan="2">
<h3 class="h3gstm">Knopflerfish&#12395;&#38306;&#12377;&#12427;&#12469;&#12509;&#12540;&#12488;&#12364;&#24517;&#35201;&#12391;&#12377;&#12363;&#12290;</h3>
<p>
&#12466;&#12540;&#12488;&#12473;&#12506;&#12540;&#12473;&#12539;&#12486;&#12524;&#12510;&#12486;&#12451;&#12483;&#12463;&#12473;&#31038;&#12399;&#12289;&#33258;&#30001;&#12395;&#21033;&#29992;&#21487;&#33021;&#12394;&#12501;&#12524;&#12540;&#12512;&#12527;&#12540;&#12463;Knopflerfish&#12395;&#35036;&#36275;&#30340;&#12394;&#12511;&#12489;&#12523;&#12454;&#12455;&#12450;&#12539;&#12469;&#12540;&#12499;&#12473;&#12392;&#35069;&#21697;&#12434;&#25552;&#20379;&#12375;&#12390;&#12362;&#12426;&#12289;
Knopflerfish&#21033;&#29992;&#20225;&#26989;&#12364;&#12289;&#26368;&#32066;&#35069;&#21697;&#32676;&#12395;&#12458;&#12540;&#12503;&#12531;&#12539;&#12477;&#12540;&#12473;&#12539;&#12477;&#12501;&#12488;&#12454;&#12455;&#12450;&#12434;&#27083;&#31689;&#12391;&#12365;&#12427;&#30906;&#23455;&#12394;&#29872;&#22659;&#12434;&#20445;&#35388;&#12375;&#12414;&#12377;&#12290;
</p>
<p>
&#20027;&#12394;&#25552;&#20379;&#35069;&#21697;&#12539;&#12469;&#12540;&#12499;&#12473;&#12392;&#12375;&#12390;&#12399;&#12289;OSGi&#25645;&#36617;&#27231;&#22120;&#12395;&#23550;&#24540;&#12391;&#12365;&#12427;&#12522;&#12514;&#12540;&#12488;&#12539;&#12510;&#12493;&#12472;&#12513;&#12531;&#12488;&#12289;&#23436;&#20840;&#12394;&#12469;&#12509;&#12540;&#12488;&#21332;&#23450;&#12289;
Knopflerfish&#12434;&#32173;&#25345;&#12375;&#12390;&#12356;&#12367;&#12409;&#12365;&#23554;&#38272;&#25216;&#34899;&#12392;&#12467;&#12531;&#12469;&#12523;&#12486;&#12451;&#12531;&#12464;&#12539;&#12469;&#12540;&#12499;&#12473;&#12434;&#21547;&#12435;&#12384;&#21830;&#29992;&#29256;Knopflerfish Pro&#12391;&#12377;&#12290;
</p>
&#35443;&#32048;&#12399;&#12289;&#12466;&#12540;&#12488;&#12473;&#12506;&#12540;&#12473;&#12539;&#12486;&#12524;&#12510;&#12486;&#12451;&#12483;&#12463;&#12473;&#31038;&#12398;&#12506;&#12540;&#12472;&#12434;&#21442;&#29031;&#12367;&#12384;&#12373;&#12356;&#12290;
<a href="http://www.gatespacetelematics.com">
http://www.gatespacetelematics.com</a>
</td>
</tr>
</tbody></table>